setup.yml
config:
  target: 'https://bethtest.test.pactflow.io'
  phases:
    - duration: 100
      arrivalRate: 2
  http:
    tls:
      rejectUnauthorized: true
  environments:
    dev:
      target: "https://bethtest.test.pactflow.io"
  payload:
    -
      path: "./fixtures/accounts-{{ $environment }}.csv"
      fields:
        - "host"
        - "authorization"
      order: "sequence"
    -
      path: "./fixtures/pacticipants.csv"
      fields:
        - "consumer"
        - "provider"
      order: "sequence"
  processor: "./src/load-test-functions.js"

scenarios:
  # API publishing and retrieval
  # This will publish to one of different consumer/provider pairs _per virtual user_ (each version should be different)
  # and then tag them with 'dev' and 'prod'
  - name: Publish pacts
    flow:
      - log: "Creating pact for between {{consumer}}<->{{provider}} on broker {{host}}"
      - put:
          url: "/pacts/provider/{{provider}}/consumer/{{consumer}}/version/{{version}}"
          beforeRequest: "setupPactPublish"
          headers:
            Host: "{{ host }}"
            Authorization: "{{ authorization }}"
            Content-Type: "application/json"
      - get:
          url: "/pacts/provider/{{provider}}/consumer/{{consumer}}/version/{{version}}"
          headers:
            Host: "{{ host }}"
            Authorization: "{{ authorization }}"
            Accept: "application/json"
      - put:
          url: "/pacticipants/{{consumer}}/versions/{{version}}/tags/prod"
          headers:
            Host: "{{ host }}"
            Authorization: "{{ authorization }}"
            Content-Type: "application/json"